# Pandas Data Frame

##  <font color='green'> <b>DataFrames </b><font color='black'>

DataFrame, iki boyutlu bir veri koleksiyonudur. 

Verilerin tablo şeklinde (tabular) saklandığı bir veri yapısıdır. 

Veri kümeleri satırlar ve sütunlar halinde düzenlenir; veri çerçevesinde birden çok veri kümesi depolayabiliriz.

DataFrame'i, aynı dizini paylaşmak için bir araya getirilmiş bir dizi Series nesnesi olarak düşünebiliriz.

Veri çerçevesine sütun/satır seçimi ve sütun/satır ekleme gibi çeşitli aritmetik işlemleri gerçekleştirebiliriz.

DataFrame'leri harici depolamadan içe aktarabiliriz; SQL Veritabanı, CSV dosyası ve bir Excel dosyası.

[SOURCE01](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm), 
[SOURCE02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html), 
[SOURCE03](https://morioh.com/p/2528ac775b1b), 
[SOURCE04](https://www.datacamp.com/community/tutorials/
[SOURCE05](https://www.guru99.com/python-pandas-tutorial.html), 
[SOURCE06](https://realpython.com/pandas-dataframe/) &
[SOURCE07](https://towardsdatascience.com/a-simple-guide-to-pandas-dataframes-b125f64e1453)<br>
[VIDEO SOURCE01](https://www.youtube.com/watch?v=zmdjNSmRXF4), 
[VIDEO SOURCE02](https://www.youtube.com/watch?v=F6kmIpWWEdU) &
[VIDEO SOURCE03](https://towardsdatascience.com/pandas-dataframe-basics-3c16eb35c4f3)<br>

In [21]:
!jupyter --version

Selected Jupyter core packages...
IPython          : 8.12.0
ipykernel        : 6.19.2
ipywidgets       : 7.8.1
jupyter_client   : 7.4.9
jupyter_core     : 5.3.0
jupyter_server   : 1.23.4
jupyterlab       : 3.6.3
nbclient         : 0.5.13
nbconvert        : 6.4.5
nbformat         : 5.7.0
notebook         : 6.5.4
qtconsole        : 5.4.2
traitlets        : 5.7.1

In [1]:
import numpy as np
import pandas as pd

## <font color='blue'> <b>Creating a DataFrame Using the Lists of Data & Columns</b><font color='black'>

In [3]:
data = [["a",1,2.5], ["b",2,3.5]]
colums = ["A","B","C"]

df = pd.DataFrame(data= data, columns=colums)
df

   A  B    C
0  a  1  2.5
1  b  2  3.5

In [4]:
df.dtypes

A     object
B      int64
C    float64
dtype: object

In [5]:
df.applymap(type) #  applymap fonk. herbir satir ve sutuna gider parantez icine ne yazilirsa onu verir
                  # satir ve sutunlari tara ve bunlarin type i ver demektir.yazilan fonk.applemap(type)

               A              B                C
0  <class 'str'>  <class 'int'>  <class 'float'>
1  <class 'str'>  <class 'int'>  <class 'float'>

## Creating DataFrame Using a Numpy Arrays

In [6]:
arr =np.arange(1,27,3) .reshape(3,3)
arr

array([[ 1,  4,  7],
       [10, 13, 16],
       [19, 22, 25]])

In [7]:
df = pd.DataFrame(data =arr)
df

    0   1   2
0   1   4   7
1  10  13  16
2  19  22  25

In [8]:
df = pd.DataFrame(data =arr , columns=["A1","A2","A3"], index= ["B1","B2","B3"])
df

    A1  A2  A3
B1   1   4   7
B2  10  13  16
B3  19  22  25

In [9]:
df = pd.DataFrame(arr , ["A1","A2","A3"], ["B1","B2","B3"])
df

# 2 ve 3 parametre sirasi degisti,default ta index ten sonra columns geldigi icin boyle oldu

    B1  B2  B3
A1   1   4   7
A2  10  13  16
A3  19  22  25

## Creating a Data Frame Using a Dictionary

In [10]:
data = {"name": ["Ayse", "Ahmet", "Mehmet"], "Age":[20,30,40]}
data

{'name': ['Ayse', 'Ahmet', 'Mehmet'], 'Age': [20, 30, 40]}

In [11]:
df = pd.DataFrame(data)
df

     name  Age
0    Ayse   20
1   Ahmet   30
2  Mehmet   40

## Basic Attributes  & Methods of DataFrames

In [12]:
df.head

<bound method NDFrame.head of      name  Age
0    Ayse   20
1   Ahmet   30
2  Mehmet   40>

In [13]:
df.tail(2)

     name  Age
1   Ahmet   30
2  Mehmet   40

In [14]:
df.sample()

   name  Age
0  Ayse   20

In [16]:
df.columns

Index(['name', 'Age'], dtype='object')

In [17]:
df.columns[0]

'name'

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.mean() # hata verir.mean numeric sutunlar uzerinde calisir.

In [22]:
df.Age

0    20
1    30
2    40
Name: Age, dtype: int64

In [25]:
df.Age.mean()   # yas sutunun ort.

30.0

In [26]:
df.columns

Index(['name', 'Age'], dtype='object')

In [27]:
df.columns =["Isim", "Yas"]
df

     Isim  Yas
0    Ayse   20
1   Ahmet   30
2  Mehmet   40

In [28]:
df.rename(columns={"isim": "Name", "Yas": "Age"}) # satir ve sutun isimleri degistirme  # kalic degistirmez

     Isim  Age
0    Ayse   20
1   Ahmet   30
2  Mehmet   40

In [29]:
df.columns

Index(['Isim', 'Yas'], dtype='object')

In [30]:
df.rename(columns={"isim": "Name", "Yas": "Age"}, inplace= True) # inplace=True fonk.sutunlari kalici olarak degistirir.

In [31]:
df

     Isim  Age
0    Ayse   20
1   Ahmet   30
2  Mehmet   40

In [32]:
df.rename(columns={"isim": "Name", "Yas": "Age"},inplace=1)
df

     Isim  Age
0    Ayse   20
1   Ahmet   30
2  Mehmet   40

In [33]:
df.index =["a","b","c"]
df

     Isim  Age
a    Ayse   20
b   Ahmet   30
c  Mehmet   40

In [35]:
df.shape[0] # satir sayisini aliriz

3

In [36]:
df.shape[1] # sutun sayisni aliriz

2

In [38]:
df.ndim  # kac boyutlu oldugunu gosterir

2

In [39]:
df.size  # kac eleman oldugunu gosterir

6

In [40]:
"Name" in df   # durum kontrolu yani df icersinde  name var mi

False

In [41]:
"Isim " in df

False

In [43]:
df["Isim"] == "Ayse"

a     True
b    False
c    False
Name: Isim, dtype: bool

In [45]:
df[df["Isim"]== "Ayse"]

   Isim  Age
a  Ayse   20